app/controllers/aaa_controller.rb

  def authenticate

  set_session

  unless no_use_waiting
    begin

    @purchase = Purchase.find(session[:purchase_id])

    if @purchase.authorization_date? and params[:pin]== session[:expected_pin]
      @status = "That's it. You're done."
      @message = "Enjoy the game!"
      @purchase.authentication_date = Time.now
      @purchase.save
---
UPDATE "purchases" SET "authentication_date" = '2010-03-09 22:42:55', "updated_at" = '2010-03-09 22:42:55' WHERE "id" = 21