app/controllers/aaa_controller.rb

SELECT * FROM "purchases" WHERE ("purchases"."id" = 50)
---
  def set_session

  # If no product was selected first, no use to do anything. This will be found in no_use_waiting, which is next.
    if session[:product].nil?
      @no_product_selected = true
      return
    end

  # We can therefore assume that the following must be set by now
    @product = session[:product]
    @product_title = session[:product_title]
    @product_price = session[:product_price]
    @retailer_name = "Zynga"

  # We clear the product session, to force passing thru the product selection next time too
  # For the rest of that call, we should use only @ product variables, not session ones
    session[:product] = session[:product_title] = session[:product_price] = nil


  # if the phone in the parameters matches the prev one, and the product matches the prev purchase, then we assume it's the same session:
  # that means we're expecting the same pin, or still waiting, or no use waiting, or just about to complete the process now.
  # However, if it differs, we clear the session

    last_purchase = Purchase.find_by_id(session[:purchase_id]) if session[:purchase_id]

SELECT "consumers".id FROM "consumers" WHERE ("consumers"."billing_phone" = '4444444444') LIMIT 1
---
    else

       clear_session
       @consumer = Consumer.find_or_initialize_by_billing_phone(params[:consumer][:billing_phone])

INSERT INTO "consumers" ("updated_at", "billing_phone", "payer_id", "created_at") VALUES('2010-02-19 10:10:01', 'set at debugger', 9, '2010-02-19 10:10:01')
INSERT INTO "payers" ("user", "salt", "name", "updated_at", "hashed_password", "Exists", "email", "balance", "pin", "created_at") VALUES('0.543518359814444', NULL, NULL, '2010-03-09 21:07:20', '0.898235877043174', NULL, NULL, 0.0, NULL, '2010-03-09 21:07:20')
UPDATE "payers" SET "balance" = 10.01, "updated_at" = '2010-02-24 10:47:41' WHERE "id" = 22
SELECT * FROM "payer_rules" WHERE ("payer_rules".payer_id = 22) ORDER BY created_at DESC LIMIT 1
---
  def find_consumer_and_payer

     @consumer = Consumer.find_by_billing_phone(params[:consumer][:billing_phone])
     unless @consumer
        begin
          @consumer = Consumer.new(params[:consumer])
          @consumer.payer = Payer.new(:exists => false)
          @consumer.save!
        rescue #RecordInvalid
          flash[:notice] = "Consumer and/or payer didn't pass validation"
        end
     end
     @payer = @consumer.payer
     @consumer_rule = @consumer.most_recent_payer_rule if @payer.exists

INSERT INTO "retailers" ("salt", "name", "updated_at", "hashed_password", "username", "billed", "collected", "email", "created_at") VALUES(NULL, 'shmynga', '2010-02-21 16:27:15', NULL, NULL, NULL, NULL, NULL, '2010-02-21 16:27:15')
SELECT "retailers".id FROM "retailers" WHERE ("retailers"."name" = 'zynga') LIMIT 1
SELECT "products".* FROM "products" INNER JOIN "items" ON "products".id = "items".product_id WHERE (("items".retailer_id = 1) AND (title = 'sword' and price = 9.99)) LIMIT 1
SELECT * FROM "retailers" WHERE ("retailers"."id" = 4)
INSERT INTO "products" ("image_url", "updated_at", "title", "price", "category_id", "description", "created_at") VALUES('image.png', '2010-02-17 18:02:56', 'newtitle', 10.0, 1, 'newdescri', '2010-02-17 18:02:56')
---
  def find_retailer_and_product
    @retailer = Retailer.find_or_create_by_name(@retailer_name)
    @product = @retailer.products.find(:first,
              :conditions => ["title = ? and price = ?", @product_title, @product_price])

    unless @product
      @product = @retailer.products.create(:category_id => 1, :title => @product_title, :price => @product_price)

INSERT INTO "purchases" ("updated_at", "authentication_type", "authorization_date", "retailer_id", "date", "product_id", "authorization_type", "amount", "billing_date", "billing_type", "payer_id", "created_at", "authentication_date") VALUES('2010-03-09 21:43:33', NULL, NULL, 1, '2010-03-09 23:43:33', 1, NULL, 9.99, NULL, NULL, 9, '2010-03-09 21:43:33', NULL)
---
  def find_or_create_purchase

     if session[:purchase_id]
       @purchase = Purchase.find(session[:purchase_id])
     else
       @purchase = @payer.purchases.create(:consumer_id => @consumer.id, :payer_id => @payer.id, :retailer_id => @retailer.id, :product_id => @product.id, :amount => @product.price, :date => Time.now, :location => generate_location)