app/controllers/aol_controller.rb

INSERT INTO "payers" ("salt", "name", "user", "updated_at", "hashed_password", "email", "balance", "created_at", "pin") VALUES('392257700.459896492382672', NULL, 'drorp24', '2010-03-04 17:23:33', 'dd83322ae99255b8d58ecd375a32b811c1b66740', NULL, NULL, '2010-03-04 17:23:33', NULL)
INSERT INTO "payer_rules" ("auto_deny_over", "updated_at", "billing_id", "allowance", "auto_authorize_under", "authorization_phone", "payer_id", "rollover", "created_at") VALUES(NULL, '2010-03-08 12:47:22', 1, NULL, NULL, NULL, 46, 'f', '2010-03-08 12:47:22')
---
  def create
    payer = Payer.new(params[:payer])
#    payer.balance = 0                    # should be set to 0 already by joinin. Also check exists is set.

    if payer.save
      session[:payer_id] = payer.id
      session[:payer_user] = payer.user                            # do I use it?
      rule = payer.payer_rules.create(:rollover => 0, :billing_id => 1)

SELECT * FROM "payers" WHERE ("payers"."id" = 44)
---
  def account_form        # decide if I want a rescue like this in other activities or assume you never start here

    begin
    @payer = Payer.find(session[:payer_id])

SELECT * FROM "payers" WHERE ("payers"."id" = 44)
UPDATE "payers" SET "hashed_password" = '0e900e5f787a7eec33dda64d39067d03a9c9cb22', "updated_at" = '2010-03-08 09:58:54', "salt" = '394804400.390077571829609' WHERE "id" = 44
---
  def account_update
    payer = Payer.find(session[:payer_id])

    if payer.update_attributes(params[:payer])

SELECT * FROM "payers" WHERE ("payers"."id" = 37)
---
  def budget_form
    @payer = Payer.find(session[:payer_id])

SELECT * FROM "payers" WHERE ("payers"."id" = 37)
SELECT * FROM "payer_rules" WHERE ("payer_rules".payer_id = 37) ORDER BY created_at DESC LIMIT 1
UPDATE "payer_rules" SET "rollover" = 't', "allowance" = 501.0, "updated_at" = '2010-03-08 13:56:31' WHERE "id" = 1
---
  def budget_update

    @payer = Payer.find(session[:payer_id])
    @rule = PayerRule.find(session[:rule_id])
    unless @rule
      flash[:notice] = "No rule set for this payer"
      redirect_to :action => :joinin
      return
    end

    if @rule.update_attributes(params[:rule])

SELECT * FROM "payers" WHERE ("payers"."id" = 1)
SELECT * FROM "payer_rules" WHERE ("payer_rules"."id" = 1)
---
  def amounts_form                        # make it graphical one day

    @payer = Payer.find(session[:payer_id])
    @rule = PayerRule.find(session[:rule_id])

SELECT * FROM "payer_rules" WHERE ("payer_rules"."id" = 1)
UPDATE "payer_rules" SET "auto_authorize_under" = 20.0, "updated_at" = '2010-03-08 14:31:56', "auto_deny_over" = 100.0, "authorization_phone" = 54234322033333 WHERE "id" = 1
---
  def amounts_update                      # identicai to budget_update and possible others too - create method
    @payer =PayerRule.find(session[:rule_id])
    @rule = PayerRule.find(session[:rule_id])
    unless @rule
      flash[:notice] = "No rule set for this payer"
      redirect_to :action => :joinin
      return
    end

    if @rule.update_attributes(params[:rule])

SELECT * FROM "payer_rules"
---
  def graph
    @rules = PayerRule.all