app/controllers/payer_rule_categories_controller.rb

  def index
    @payer_rule_categories = PayerRuleCategory.all
---
SELECT * FROM "payer_rule_categories"

  def show
    @payer_rule_category = PayerRuleCategory.find(params[:id])
---
SELECT * FROM "payer_rule_categories" WHERE ("payer_rule_categories"."id" = 1)

  def create
    @payer_rule_category = PayerRuleCategory.new(params[:payer_rule_category])

    respond_to do |format|
      if @payer_rule_category.save
---
INSERT INTO "payer_rule_categories" ("updated_at", "approved", "category_id", "payer_rule_id", "created_at") VALUES('2010-02-04 21:12:02', 0, NULL, NULL, '2010-02-04 21:12:02')