app/controllers/payer_rules_controller.rb

  def index
    @payer_rules = PayerRule.all
---
SELECT * FROM "payer_rules"

  def show
    @payer_rule = PayerRule.find(params[:id])
---
SELECT * FROM "payer_rules" WHERE ("payer_rules"."id" = 1)

  def create
    @payer_rule = PayerRule.new(params[:payer_rule])

    respond_to do |format|
      if @payer_rule.save
---
INSERT INTO "payer_rules" ("updated_at", "allowance", "approval_phone_number", "auto_approve_under", "billing_phone_number", "auto_reject_over", "payer_id", "billing_by", "rollover", "pin", "created_at") VALUES('2010-02-04 20:36:51', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'f', NULL, '2010-02-04 20:36:51')

  def destroy
    @payer_rule = PayerRule.find(params[:id])
    @payer_rule.destroy
---
SELECT * FROM "payer_rules" WHERE ("payer_rules"."id" = 1)
DELETE FROM "payer_rules" WHERE "id" = 1