app/controllers/payers_controller.rb

  def index
    @payers = Payer.all
---
SELECT * FROM "payers"

  def show
    @payer = Payer.find(params[:id])
---
SELECT * FROM "payers" WHERE ("payers"."id" = 1)

  def create
    @payer = Payer.new(params[:payer])

    respond_to do |format|
      if @payer.save
---
INSERT INTO "payers" ("name", "salt", "updated_at", "hashed_password", "username", "pay_type", "email", "balance", "created_at") VALUES('Dror Poliak', '', '2010-02-04 17:03:52', '', 'drorp24', 'mobile', 'drorp24@yahoo.com', 1.0, '2010-02-04 17:03:52')