app/controllers/purchases_controller.rb

SELECT * FROM "purchases"
---
  def index
    find_purchases
    unless @purchases.any?
      if current_payer.purchases.any?