app/controllers/retailers_controller.rb

SELECT * FROM "retailers"
---
  def index
    @retailers = Retailer.all