app/controllers/store_controller.rb

SELECT * FROM "products" ORDER BY title
---
  def index
    @products = Product.find_products_for_sale

SELECT * FROM "products" WHERE ("products"."id" = 1)
---
  def add_to_cart
    product = Product.find(params[:id])

INSERT INTO "line_items" ("order_id", "updated_at", "total_price", "product_id", "quantity", "created_at") VALUES(1, '2010-02-01 16:17:41', 59.9, 1, 2, '2010-02-01 16:17:41')
INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('AA', '2010-02-01 16:17:41', 'check', 'AA', 'AA', '2010-02-01 16:17:41')
---
   def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save