app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "salt", "updated_at", "hashed_password", "created_at") VALUES('dror', '402927100.0582502158310603', '2010-02-01 20:15:35', '6b80ce0246039e6a247b3651865390aee28d010b', '2010-02-01 20:15:35')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save